programming/misc/security_scrap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Security Scrap</title>
<!-- 2016-12-15 Thu 11:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>







</head>
<body>
<div id="content">
<h1 class="title">Security Scrap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 密码学笔记</a></li>
<li><a href="#sec-2">2. RSA 算法原理</a>
<ul>
<li><a href="#sec-2-1">2.1. 一点历史</a></li>
<li><a href="#sec-2-2">2.2. 互质关系</a></li>
<li><a href="#sec-2-3">2.3. 欧拉函数</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 推论一</a></li>
<li><a href="#sec-2-3-2">2.3.2. 推论二</a></li>
<li><a href="#sec-2-3-3">2.3.3. 推论三</a></li>
<li><a href="#sec-2-3-4">2.3.4. 推论四</a></li>
<li><a href="#sec-2-3-5">2.3.5. 结论</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. 欧拉定理</a></li>
<li><a href="#sec-2-5">2.5. 模反元素</a></li>
<li><a href="#sec-2-6">2.6. 密钥生成的步骤</a></li>
<li><a href="#sec-2-7">2.7. RSA 算法的可靠性</a></li>
<li><a href="#sec-2-8">2.8. 加密和解密</a>
<ul>
<li><a href="#sec-2-8-1">2.8.1. 使用公钥 (n, e) 加密</a></li>
<li><a href="#sec-2-8-2">2.8.2. 使用私钥 (n, d) 解密</a></li>
</ul>
</li>
<li><a href="#sec-2-9">2.9. 私钥解密的证明</a>
<ul>
<li><a href="#sec-2-9-1">2.9.1. m 与 n 互质</a></li>
<li><a href="#sec-2-9-2">2.9.2. m 与 n 不互质</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. DDoS - Impossible to stop?</a></li>
<li><a href="#sec-4">4. Why are DDoS attacks so hard to stop?</a></li>
<li><a href="#sec-5">5. Someone Is Learning How to Take Down the Internet</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 密码学笔记</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://www.ruanyifeng.com/blog/2006/12/notes_on_cryptography.html">Source</a>
</p>

<p>
加密方法可以分为两大类：一类是私钥加密（private key cryptography），一类是公钥加密（public key cryptography）。前者的加密和解密过程都用同一套密码，后者的加密和解密过程用的是两套密码。
</p>

<p>
历史上，人类传统的加密方法都是前一种，比如二战期间德军使用的 Enigma 电报密码。莫尔斯电码也可以看作是一种私钥加密方法。私钥加密的密钥只有一把，所以密钥的保存很重要。一旦密钥泄漏，密码也就被破解。
</p>

<p>
在公钥加密的情况下，密钥有两把：公开的公钥，和不公开的私钥。公钥加密的原理：
</p>

<ul class="org-ul">
<li>公钥和私钥是一一对应的。
</li>
<li>所有的「公钥—私钥」对都是唯一的。
</li>
<li>用公钥可以解开私钥加密的信息，反之亦成立。
</li>
<li>同时生成公钥和私钥比较容易，但是从公钥推算出私钥，是很困难或者不可能的。
</li>
</ul>

<p>
<span class="underline">目前，通用的私钥加密算法为 DES（Data Encryption Standard），通用的公钥加密算法为 RSA（ Rivest-Shamir-Adleman），</span> 都产生于上世纪 70 年代。
</p>

<p>
在双钥体系中， <span class="underline">公钥用来加密信息，私钥用来数字签名。</span>
</p>

<p>
因为任何人都可以生成「公钥—私钥」对，为了防止散布伪造的公钥的行为，需要一个可靠的第三方机构来生成经过认证的「公钥—私钥」对。目前，世界上最主要的数字服务认证商是美国的 Verisign 公司，它的主要业务就是分发 RSA 数字证书。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> RSA 算法原理</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.ruanyifeng.com/blog/2013/06/rsa_algorithm_part_one.html">Source</a>
</p>

<p>
公钥加密算法是计算机通信安全的基石。
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 一点历史</h3>
<div class="outline-text-3" id="text-2-1">
<p>
1976 年以前，所有的加密方法都是同一种模式：
</p>

<ul class="org-ul">
<li>甲方选择某一种加密规则，对信息进行加密。
</li>
<li>乙方使用同一种规则，对信息进行解密。
</li>
</ul>

<p>
由于加密和解密使用同样规则（简称「密钥」），这被称为「对称加密算法」（symmetric-key algorithm）。这种加密模式有一个 <span class="underline">最大弱点：甲方必须把加密规则告诉乙方，否则无法解密。</span> 保存和传递密钥，就成了最头疼的问题。
</p>

<p>
1976 年，两位美国计算机学家 Whitfield Diffie 和 Martin Hellman，提出了一种崭新构思，可以在不直接传递密钥的情况下，完成解密。这被称为 <span class="underline">Diffie-Hellman 密钥交换算法</span> 。这个算法启发了其他科学家。人们认识到， <span class="underline">加密和解密可以使用不同的规则，只要这两种规则之间存在某种对应关系即可，这样就避免了直接传递密钥。</span>
</p>

<p>
这种新的加密模式被称为「非对称加密算法」：
</p>

<ul class="org-ul">
<li>乙方生成两把密钥：公钥是公开的，任何人都可以获得，私钥则是保密的。
</li>
<li>甲方获取乙方的公钥，然后用它对信息加密。
</li>
<li>乙方得到加密后的信息，用私钥解密。
</li>
</ul>

<p>
1977 年，三位数学家 Rivest、Shamir 和 Adleman 设计了一种算法，可以实现非对称加密。这种算法用他们三个人的名字命名，叫做 <span class="underline">RSA 算法</span> 。从那时直到现在，RSA 算法一直是最广为使用的非对称加密算法。毫不夸张地说，只要有计算机网络的地方，就有 RSA 算法。
</p>

<p>
这种算法非常可靠（<a href="http://en.wikipedia.org/wiki/RSA_Factoring_Challenge">RSA Factoring Challenge</a>），密钥越长，就越难破解。根据已经披露的文献， <span class="underline">目前被破解的最长 RSA 密钥是 768 个二进制位。</span> 也就是说，长度超过 768 位的密钥，还无法破解（至少没人公开宣布）。因此可以认为， <span class="underline">1024 位的 RSA 密钥基本安全，2048 位的密钥极其安全。</span>
</p>

<p>
RSA 算法并不难，只需要一点数论知识（<a href="http://jeremykun.com/2011/07/30/number-theory-a-primer/">Number Theory: A Primer</a>）就可以理解。
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 互质关系</h3>
<div class="outline-text-3" id="text-2-2">
<p>
如果两个正整数，除了 1 以外，没有其他公因子，我们就称这两个数是互质关系（coprime）。比如，15 和 32 没有公因子，所以它们是互质关系。这说明，不是质数也可以构成互质关系。关于互质关系，不难得到以下结论：
</p>

<ul class="org-ul">
<li>任意两个质数构成互质关系。
</li>
<li>一个数是质数，另一个数只要不是前者的倍数，两者就构成互质关系。
</li>
<li>如果两个数之中，较大的那个数是质数，则两者构成互质关系。
</li>
<li>1 和任意一个自然数是都是互质关系。
</li>
<li>对大于 1 的整数 p，p 和 p-1 构成互质关系。
</li>
<li>对大于 1 的奇数 p，p 和 p-2 构成互质关系。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 欧拉函数</h3>
<div class="outline-text-3" id="text-2-3">
<blockquote>
<p>
任意正整数 n，在小于等于 n 的正整数之中，有多少个与 n 构成互质关系？
</p>
</blockquote>

<p>
计算这个值的方法就叫做 <del>欧拉函数</del> ，以 $\varphi(n)$ 表示。在 1 到 8 之中，与 8 形成互质关系的是 1、3、5、7，所以 $&varphi;(8) = 4$。$\varphi(n)$ 的计算方法并不复杂，但是为了得到最后那个公式，需要一步步讨论。
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 推论一</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
$$\varphi(1) = 1$$
</p>

<p>
因为 1 与任何数（包括自身）都构成互质关系。
</p>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> 推论二</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
如果 n 是质数，则
</p>

<p>
$$\varphi(n) = n - 1$$
</p>

<p>
因为质数与小于它的每一个数都构成互质关系。
</p>
</div>
</div>
<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> 推论三</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
如果 $n = p^k$ (p 为质数，k 为大于等于 1 的整数)，则
</p>

<p>
$$\varphi(n) = p^k - p^{k-1} = p^k(1 - \frac{1}{p})$$
</p>

<p>
因为只有不是质数 p 的倍数，才可能与 n 互质。而质数 p 的倍数一共有 $p^{k-1}$ 个，即 $1 &times; p, 2 &times; p, &hellip; p^{k-1} &times; p$，把它们去除，剩下的就是与 n 互质的数。
</p>

<p>
可以看出，第二种情况情况是 k = 1 时的特例。
</p>
</div>
</div>
<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="section-number-4">2.3.4</span> 推论四</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
如果 n 可以分解成两个互质的整数之积 $n = p_1 &times; p_2$，则
</p>

<p>
$$\varphi(n) = \varphi(p_1 p_2) = \varphi(p_1) \varphi(p_2)$$
</p>

<p>
即「积的欧拉函数等于各个因子的欧拉函数之积」。
</p>

<p>
这一条的证明要用到「中国剩余定理」，只简单说一下思路：如果 a 与 p1 互质（a &lt; p1），b 与 p2 互质（b &lt; p2），c 与 p1p2 互质（c &lt; p1p2），则 c 与数对 (a,b) 是一一对应关系。由于 a 的值有 $\varphi(p_1)$ 种可能，b 的值有 $\varphi(p_2)$ 种可能，则数对 (a,b) 有 $\varphi(p_1) \varphi(p_2)$ 种可能，而 c 的值有 $\varphi(p_1p_2)$ 种可能，所以 $&varphi;(p_1p_2) = &varphi;(p_1) &varphi;(p_2)$。
</p>
</div>
</div>
<div id="outline-container-sec-2-3-5" class="outline-4">
<h4 id="sec-2-3-5"><span class="section-number-4">2.3.5</span> 结论</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
因为任意一个大于 1 的正整数，都可以写成多个质数的幂的积：$n = p_1^{k_1} p_2^{k_2} \ldots p_r^{k_r}$。根据推论四和推论三得到：
</p>

<p>
$$\begin{align} \varphi(n) & = \varphi(p_1^{k_1}) \varphi(p_2^{k_2}) \ldots \varphi(p_r^{k_r}) \\ & = p_1^{k_1} p_2^{k_2} \ldots p_r^{k_r} (1 - \frac{1}{p_1}) (1 - \frac{1}{p_2}) \ldots (1 - \frac{1}{p_r}) \\ & = n (1 - \frac{1}{p_1}) (1 - \frac{1}{p_2}) \ldots (1 - \frac{1}{p_r}) \end{align}$$
</p>

<p>
这就是欧拉函数的通用计算公式。比如，1323 的欧拉函数，计算过程如下：
</p>

<p>
$$\varphi(1323) = \varphi(3^3 \times 7^2) = 1323 (1 - \frac{1}{3}) (1 - \frac{1}{7}) = 756$$
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 欧拉定理</h3>
<div class="outline-text-3" id="text-2-4">
<p>
欧拉函数的用处，在于 <del>欧拉定理</del> ：如果两个正整数 a 和 n 互质，则 n 的欧拉函数可以让下面的等式成立：
</p>

<p>
$$a^{\varphi(n)} \equiv 1 \pmod{n}$$
</p>

<p>
也就是说，$a^{\varphi(n)}$ 被 n 除的余数为 1。或者说，$a^{\varphi(n)} - 1$ 可以被 n 整除。比如，3 和 7 互质，而 7 的欧拉函数等于 6，所以 3 的 6 次方 729 减去1，可以被 7 整除。
</p>

<p>
欧拉定理可以大大简化某些运算。比如，7 和 10 互质，根据欧拉定理，$7^{\varphi(10)} \equiv 1 \pmod{10}$ ，已知 $&varphi;(10) = 4$，所以马上得到 7 的 4 倍数次方的个位数肯定是 1，因此，7 的任意次方的个位数心算就可以算出来。 <span class="underline">欧拉定理是 RSA 算法的核心。</span> 理解了这个定理，就可以理解 RSA。
</p>

<p>
欧拉定理有一个特殊情况，假设正整数 a 与质数 p 互质，因为 $&varphi;(p) = p - 1$，则欧拉定理可以写成：
</p>

<p>
$$a^{p-1} \equiv 1 \pmod{p}$$
</p>

<p>
这就是著名的 <del>费马小定理</del> 。它是欧拉定理的特例。
</p>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 模反元素</h3>
<div class="outline-text-3" id="text-2-5">
<p>
如果两个正整数 a 和 n 互质，那么一定可以找到整数 b，使得：
</p>

<p>
$$ab \equiv 1 \pmod{n}$$
</p>

<p>
b 就叫做 a 的「模反元素」。比如，3 和 11互质，那么 3 的模反元素就是 4，因为 $3 &times; 4 - 1 = 11$。显然，模反元素不止一个，4 加减 11 的整数倍都是 3 的模反元素：… -18，-7，4，15，26 …，即如果 b 是 a 的模反元素，则 b+kn 都是 a 的模反元素。
</p>

<p>
欧拉定理可以用来证明模反元素必然存在：
</p>

<p>
$$a^{\varphi(n)} = a \times a^{\varphi(n)-1} \equiv 1 \pmod{n}$$
</p>

<p>
可以看到，$a^{\varphi(n)-1}$ 就是 a 的模反元素。
</p>
</div>
</div>
