programming/misc/security_scrap.html
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 密钥生成的步骤</h3>
<div class="outline-text-3" id="text-2-6">
<p>
通过一个例子，来理解 RSA 算法。假设 A 要与 B 进行加密通信，A 该怎么生成公钥和私钥呢？
</p>

<p>
第一步，随机选择 <span class="underline">两个不相等的质数 p 和 q</span> 。实际应用中，这两个质数越大，就越难破解。A 选择了 61 和 53。
</p>

<p>
第二步，计算 <span class="underline">p 和 q 的乘积 n</span> = 61 x 53 = 3233， <span class="underline">n 的长度就是密钥长度。</span> 3233 写成二进制是 110010100001，一共有 12 位，所以这个密钥就是 12 位。实际应用中，RSA 密钥一般是 1024 位，重要场合则为 2048 位。
</p>

<p>
第三步，计算 <span class="underline">n 的欧拉函数</span> 。$\varphi(3233) = \varphi(61) \varphi(53) = (61 - 1) (53 - 1) = 3120$
</p>

<p>
第四步，随机选择一个 <span class="underline">整数 e，条件是 $1 &lt; e &lt; &varphi;(n)$，且 e 与 $\varphi(n)$ 互质</span> 。实际应用中，常常选择 65537。A 选择了 17。
</p>

<p>
第五步，计算 <span class="underline">e 对于 $\varphi(n)$ 的模反元素 d，使得 $ed &equiv; 1 \pmod{\varphi(n)}$，</span> 实质上就是对下面这个二元一次方程求解：
</p>

<p>
$$ex + \varphi(n)y = 1$$
</p>

<p>
这个方程可以用「扩展欧几里得算法」求解，此处省略具体过程。A 算出一组整数解为 (2753, -15)，即 d = 2753。
</p>

<p>
第六步， <span class="underline">将 n 和 e 封装成公钥，n 和 d 封装成私钥。</span> 例子中，n = 3233，e = 17，d = 2753，所以公钥就是 (3233, 17)，私钥就是（3233, 2753）。实际应用中，公钥和私钥的数据都采用 ASN.1 格式表达。
</p>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> RSA 算法的可靠性</h3>
<div class="outline-text-3" id="text-2-7">
<p>
回顾上面的密钥生成步骤，一共出现 6 个数字：p，q，n，$&varphi;(n)$，e，d。这 6 个数字之中，公钥用到了 n 和 e，其余 4 个数字都是不公开的。其中最关键的是 d，因为 n 和 d 组成了私钥，一旦 d 泄漏，就等于私钥泄漏。
</p>

<p>
那么，有无可能在已知 n 和 e 的情况下，推导出 d？
</p>

<ul class="org-ul">
<li>$ed &equiv; 1 \pmod{\varphi(n)}$，只有知道 e 和 $&varphi;(n)$，才能算出 d。
</li>
<li>$&varphi;(n) = (p - 1) (q - 1)$，只有知道 p 和 q，才能算出 $&varphi;(n)$。
</li>
<li>$n = pq$，只有将 n 因数分解，才能得到 p 和 q。
</li>
</ul>

<p>
可是， <span class="underline">大整数的因数分解，是一件非常困难的事情。目前除了暴力破解，还没有发现别的有效方法。</span> 维基百科这样写道：
</p>

<blockquote>
<p>
对极大整数做因数分解的难度决定了 RSA 算法的可靠性。换言之，对一极大整数做因数分解愈困难，RSA 算法愈可靠。假如有人找到一种快速因数分解的算法，那么 RSA 的可靠性就会极度下降。但找到这样的算法的可能性是非常小的。今天只有短的 RSA 密钥才可能被暴力破解。到 2008 年为止，世界上还没有任何可靠的攻击 RSA 算法的方式。 <span class="underline">只要密钥长度足够长，用 RSA 加密的信息实际上是不能被解破的。</span>
</p>
</blockquote>

<div class="org-src-container">
<label class="org-src-name">举例来说，可以对 3233 进行因数分解，但是没法对下面这个整数进行因数分解：</label>
<pre class="src src-code">12301866845301177551304949
58384962720772853569595334
79219732245215172640050726
36575187452021997864693899
56474942774063845925192557
32630345373154826850791702
61221429134616704292143116
02221240479274737794080665
351419597459856902143413
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name">它等于这样两个质数的乘积：</label>
<pre class="src src-code">33478071698956898786044169
84821269081770479498371376
85689124313889828837938780
02287614711652531743087737
814467999489
x
36746043666799590428244633
79962795263227915816434308
76426760322838157396665112
79233373417143396810270092
798736308917
</pre>
</div>

<p>
这大概是人类已经分解的最大整数（232 个十进制位，768 个二进制位）。比它更大的因数分解，还没有被报道过，因此目前被破解的最长 RSA 密钥就是 768 位（<a href="http://eprint.iacr.org/2010/006.pdf">Factorization of a 768-bit RSA modulus</a>）。
</p>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 加密和解密</h3>
<div class="outline-text-3" id="text-2-8">
</div><div id="outline-container-sec-2-8-1" class="outline-4">
<h4 id="sec-2-8-1"><span class="section-number-4">2.8.1</span> 使用公钥 (n, e) 加密</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
假设 B 要向 A 发送加密信息 m，他就要用 A 的公钥 (n, e) 对 m 进行加密。这里需要注意，m 必须是整数（字符串可以取 ASCII 值或 Unicode 值），且 m 必须小于 n。所谓「加密」，就是算出下式的 c：
</p>

<p>
$$m^e \equiv c \pmod{n}$$
</p>

<p>
A的公钥是 (3233, 17)，B 的 m 假设是 65，那么可以算出：$65^{17} &equiv; 2790 \pmod{3233}$，于是，B 就把 2790 发给 A。
</p>
</div>
</div>
<div id="outline-container-sec-2-8-2" class="outline-4">
<h4 id="sec-2-8-2"><span class="section-number-4">2.8.2</span> 使用私钥 (n, d) 解密</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
A 得到 B 发来的 2790 以后，就用私钥 (3233, 2753) 进行解密。可以证明，下面的等式一定成立：
</p>

<p>
$$c^d \equiv m \pmod{n}$$
</p>

<p>
那么，A 计算出 $2790^{2753} &equiv; 65 \pmod{3233}$，因此 A 知道了 B 加密前的原文是 65。
</p>

<p>
可以看到，如果不知道 d，就没有办法从 c 求出 m。而前面已经说过，要知道 d 就必须分解 n，这是极难做到的，所以 RSA 算法保证了通信安全。
</p>

<p>
公钥 (n, e) 只能加密小于 n 的整数 m，如果要加密大于 n 的整数，该怎么办？有两种解决方法：
</p>

<ul class="org-ul">
<li>把长信息分割成若干段短消息，每段分别加密。
</li>
<li>先选择一种「对称性加密算法」，比如 DES，用这种算法的密钥加密信息，再用 RSA 公钥加密 DES 密钥。
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 私钥解密的证明</h3>
<div class="outline-text-3" id="text-2-9">
<p>
为什么用私钥解密，一定可以正确地得到 m，需要证明 $c^d &equiv; m \pmod{n}$。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">根据加密规则：</th>
<th scope="col" class="left">$m^e \equiv c \pmod{n}$</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">于是，c 可以写成：</td>
<td class="left">$c = m^e - kn$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">将 c 代入待证明的式子：</td>
<td class="left">$(m^e - kn)^d \equiv m \pmod{n}$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">等同于求证：</td>
<td class="left"><span class="underline">$m^{ed} \equiv m \pmod{n}$</span></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">由于模反元素 d 满足：</td>
<td class="left">$ed \equiv 1 \pmod{\varphi(n)}$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">即：</td>
<td class="left">$ed = h \varphi(n) + 1$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">将 ed 代入：</td>
<td class="left">$m^{h \varphi(n) + 1} \equiv m \pmod{n}$</td>
</tr>
</tbody>
</table>

<p>
接下来，分成两种情况证明上面这个式子。
</p>
</div>

<div id="outline-container-sec-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> m 与 n 互质</h4>
<div class="outline-text-4" id="text-2-9-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">根据欧拉定理，此时：</th>
<th scope="col" class="left">$m^{\varphi(n)} \equiv 1 \pmod{n}$</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">得到：</td>
<td class="left">$(m^{\varphi(n)})^h \times m \equiv m \pmod{n}$</td>
</tr>
</tbody>
</table>

<p>
原式得证。
</p>
</div>
</div>
<div id="outline-container-sec-2-9-2" class="outline-4">
<h4 id="sec-2-9-2"><span class="section-number-4">2.9.2</span> m 与 n 不互质</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
由于 n 等于质数 p 和 q 的乘积，所以 m 必然等于 kp 或 kq。以 m = kp 为例，考虑到这时 k 与 q 必然互质，则：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">根据欧拉定理可得：</th>
<th scope="col" class="left">$(kp)^{q-1} \equiv 1 \pmod{q}$</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">进一步得到：</td>
<td class="left">$((kp)^{q-1})^{h(p-1)} \times kp \equiv kp \pmod{q}$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">即：</td>
<td class="left">$(kp)^{ed} \equiv kp \pmod {q}$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">将它改写成：</td>
<td class="left">$(kp)^{ed} = tq + kp$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">t 必然是 p 的倍数：</td>
<td class="left">$t = t'p$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">于是：</td>
<td class="left">$(kp)^{ed} = t'pq + kp$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">因为：</td>
<td class="left">$m = kp, n = pq$</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">所以：</td>
<td class="left">$m^{ed} \equiv m \pmod{n}$</td>
</tr>
</tbody>
</table>

<p>
原式得证。
</p>
</div>
</div>
</div>
</div>
