programming/misc/security_scrap.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Why are DDoS attacks so hard to stop?</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://www.pcgamer.com/why-are-ddos-attacks-so-hard-to-stop/">Source</a>
</p>

<blockquote>
<p>
I saw that Quake Live was down because of a DDoS attack. It seems like this happens to games all the time&#x2026; so I don't understand why it can't be stopped. Will this madness ever end? ĄŞ Tom
</p>
</blockquote>

<p>
It is madness, Tom, and it ought to end&#x2026; but it isn't likely to anytime soon. <span class="underline">Distributed denial-of-service attacks can be mitigated, sometimes without any downtime, but they're really hard to beat altogether.</span>
</p>

<p>
To quickly make sense of it, here's a real world analogy: If I'm running a Starbucks and someone sneaks in, dodges the security cameras and steals all the stupid flavored syrups, that was a preventable security breach. However, if 200 non-customers enter my store at the same time and block all the real customers from ordering, that's a DDoS attack. Now I have to figure out who the real customers are and shoo all the fake customers out the door, and that's going to take time. No stupid sugar coffee for anyone.
</p>

<p>
That's grossly simplified, but the idea is the same when attacking servers: <span class="underline">overload the target with fake data so that it can't attend to real users.</span> The least sophisticated version of a denial-of-service attack would have one computer firing away at the target server without any attempt to mix up its identity, and that's not hard to stop: just block all data from that address. <span class="underline">A distributed denial-of-service attack, however, can fire away from thousands of infected computers all over the world, collectively referred to as a botnet.</span>
</p>

<p>
In my research I spoke to StrataFusion partner Mark Egan, co-author of The Executive Guide to Information Security, who explained that <span class="underline">owners of major botnets simply rent them out.</span> Want to take down EverQuest for some moronic reason? All you have to do is pay.
</p>

<p>
There are ways to mitigate DDoS attacks, and all kinds of services which offer such security, but no perfect solution. Egan explained that static content is a little easier to protect, as services like Akamai spread the data over thousands of severs, creating a big target. He suspects, however, that the dynamic nature of games makes them good targets.
</p>

<p>
One way or another, to end a DDoS attack and keep a game server operational, the hostile traffic must be filtered out. <span class="underline">One method is to 'teach' a system what good traffic looks like so that it can identify bad traffic</span>, Egan explained, but even a well-protected server can be brought down while the attack is mitigated. "If a very determined bad guy aims at you, they've got a pretty good chance [of causing an outage]," he said.
</p>

<p>
There are some very determined bad guys out there, though they may balk at the "bad" part. It has been argued that DDoS attacks should be considered a form of legal protest, the same as gathering in the streets. To decide if that can ever be a valid argument would be too much for this column's scope, but it's a pretty big stretch when it comes to game servers. No one fills the streets because they're mad at EA. And either way, the law certainly isn't having the protest angle: in the US, UK, and other countries, DoS attacks are a crime which can result in prison sentences&#x2026; if you can catch the person responsible. That's not easy.
</p>

<p>
The perpetrators of these attacks can be anywhere in the world, and the owner of the botnet could be anywhere else in the world. " <span class="underline">Very few people get caught</span>," said Egan. And while DDoS attacks can be very bad for a company, Egan says <span class="underline">the main focus in the security world is on preventing theft. A service outage is inconvenient, but stolen credit cards are far more damaging.</span>
</p>

<p>
I asked Egan if he thought it would get better, but he isn't optimistic. " <span class="underline">Each side will continue to up their game a bit," he said, meaning that more sophisticated security will only lead to more sophisticated attacks.</span> It sounds terribly fatalistic, but all we can do is hope game services are prepared to respond quickly with strong DDoS mitigation techniques. Even then, we may still be locked out of the games we want to play now and then, because some idiots just hate fun.
</p>
</div>
</div>
