programming/misc/security_scrap.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Someone Is Learning How to Take Down the Internet</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://www.schneier.com/blog/archives/2016/09/someone_is_lear.html">Source</a>
</p>

<p>
Over the past year or two, someone has been probing the defenses of the companies that run critical pieces of the Internet. These probes take the form of precisely calibrated attacks designed to determine exactly how well these companies can defend themselves, and what would be required to take them down. We don't know who is doing this, but it feels like a large nation state. China or Russia would be my first guesses.
</p>

<p>
First, a little background. <span class="underline">If you want to take a network off the Internet, the easiest way to do it is with a distributed denial-of-service attack (DDoS).</span> Like the name says, this is an attack designed to prevent legitimate users from getting to the site. There are subtleties, but <span class="underline">basically it means blasting so much data at the site that it's overwhelmed.</span> These attacks are not new: hackers do this to sites they don't like, and criminals have done it as a method of extortion. <span class="underline">There is an entire industry, with an arsenal of technologies, devoted to DDoS defense. But largely it's a matter of bandwidth. If the attacker has a bigger fire hose of data than the defender has, the attacker wins.</span>
</p>

<p>
Recently, some of the major companies that provide the basic infrastructure that makes the Internet work have seen an increase in DDoS attacks against them. Moreover, they have seen a certain profile of attacks. These attacks are significantly larger than the ones they're used to seeing. They last longer. They're more sophisticated. And <span class="underline">they look like probing. One week, the attack would start at a particular level of attack and slowly ramp up before stopping. The next week, it would start at that higher point and continue.</span> And so on, along those lines, <span class="underline">as if the attacker were looking for the exact point of failure.</span>
</p>

<p>
The attacks are also configured in such a way as to see what the company's total defenses are. <span class="underline">There are many different ways to launch a DDoS attack. The more attack vectors you employ simultaneously, the more different defenses the defender has to counter with.</span> These companies are seeing more attacks using three or four different vectors. This means that the companies have to use everything they've got to defend themselves. They can't hold anything back. They're forced to demonstrate their defense capabilities for the attacker.
</p>

<p>
I am unable to give details, because these companies spoke with me under condition of anonymity. But this all is consistent with what Verisign is reporting. Verisign is the registrar for many popular top-level Internet domains, like .com and .net. If it goes down, there's a global blackout of all websites and e-mail addresses in the most common top-level domains. Every quarter, Verisign publishes a DDoS trends report. While its publication doesn't have the level of detail I heard from the companies I spoke with, the trends are the same: "in Q2 2016, attacks continued to become more frequent, persistent, and complex."
</p>

<p>
There's more. One company told me about a variety of probing attacks in addition to the DDoS attacks: testing the ability to manipulate Internet addresses and routes, seeing how long it takes the defenders to respond, and so on. <span class="underline">Someone is extensively testing the core defensive capabilities of the companies that provide critical Internet services.</span>
</p>

<p>
Who would do this? It doesn't seem like something an activist, criminal, or researcher would do. <span class="underline">Profiling core infrastructure is common practice in espionage and intelligence gathering.</span> It's not normal for companies to do that. Furthermore, <span class="underline">the size and scale of these probes &#x2013; and especially their persistence &#x2013; points to state actors. It feels like a nation's military cybercommand trying to calibrate its weaponry in the case of cyberwar.</span> It reminds me of the US's Cold War program of flying high-altitude planes over the Soviet Union to force their air-defense systems to turn on, to map their capabilities.
</p>

<p>
<span class="underline">What can we do about this? Nothing, really. We don't know where the attacks come from.</span> The data I see suggests China, an assessment shared by the people I spoke with. On the other hand, <span class="underline">it's possible to disguise the country of origin for these sorts of attacks.</span> _The NSA, which has more surveillance in the Internet backbone than everyone else combined, probably has a better idea, but unless the US decides to make an international incident over this, we won't see any attribution._h
</p>

<p>
But this is happening. And people should know.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-12-15 Thu 11:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
